import React from 'react';

import styles from './NoActiveOrders.module.scss';

const NoActiveOrders = () => {
  return (
    <div className={styles.noActiveOrders}>
      <svg className={styles.noActiveOrders__icon} width='142' height='142' fill='none' xmlns='http://www.w3.org/2000/svg'>
        <g clipPath='url(#order-empty-state_svg__clip0_14_78)'>
          <path
            d='M35.192 74.688l27.357 41.94s-9.34 13.041-15.86 18.327c-7.447 6.039-14.762 7.669-25.2 5.287-8.458-2.82-12.447-6.243-17.093-13.569-4.582-7.225-5.286-15.507-3.524-21.851 1.938-6.979 5.422-11.631 11.278-15.86 6.344-4.582 23.042-14.274 23.042-14.274z'
            fill='#F2A98C'></path>
          <path
            d='M29.588 29.673c-.352-2.644-4.581-9.692-.704-14.45 2.839-3.485 6.837-2.983 11.278-2.292 6.202.966 12.688 9.869 12.688 9.869l42.176 70.674s-10.291 14.369-17.476 20.195c-8.206 6.653-16.266 8.45-27.768 5.825-9.32-3.107-13.716-6.879-18.835-14.952-5.049-7.961-5.826-17.088-3.884-24.078 2.136-7.69 6.015-14.646 6.402-22.596.705-14.45-3.524-25.552-3.877-28.195z'
            fill='#FFC5AB'></path>
          <path fill='#AC6BAD' d='M52.145 5.354h57.8v75.423h-57.8z'></path>
          <path fill='#fff' d='M52.152 117.431h57.8V80.777h-57.8z'></path>
          <path
            fillRule='evenodd'
            clipRule='evenodd'
            d='M105.371 5.354H56.734a4.582 4.582 0 00-4.582 4.582v102.561a4.581 4.581 0 004.582 4.581h48.637a4.582 4.582 0 004.582-4.581V9.936a4.582 4.582 0 00-4.582-4.582zM56.734.068c-5.45 0-9.869 4.418-9.869 9.868v102.561c0 5.45 4.419 9.868 9.869 9.868h48.637c5.45 0 9.868-4.418 9.868-9.868V9.936c0-5.45-4.418-9.868-9.868-9.868H56.734z'
            fill='#424242'></path>
          <rect x='59.201' y='91.703' width='43.703' height='13.393' rx='6.696' fill='#AC6BAD'></rect>
          <ellipse cx='80.7' cy='67.384' rx='20.442' ry='4.934' fill='#913E98'></ellipse>
          <path d='M63.087 18a3.193 3.193 0 016.368-.458l1.39 18.167-6.532.485L63.087 18z' fill='#FEB33C'></path>
          <path
            d='M74.804 17.285a3 3 0 013.035-2.98l.383.005a3 3 0 012.965 2.993l.042 18.41h-6.55l.125-18.428zM88.542 17.505a3 3 0 013.165-2.842l.383.022a3 3 0 012.828 3.122L94.142 36.2l-6.544-.291.944-18.405z'
            fill='#FC933A'></path>
          <path
            d='M80.81 18.772a3.256 3.256 0 016.51-.208l.59 17.81-6.548.203-.551-17.805zM68.811 18.772a3.256 3.256 0 016.51-.208l.589 17.81-6.547.203-.552-17.805zM100.781 19.037a3.265 3.265 0 00-6.473-.863l-2.373 17.654 6.51.861 2.336-17.652z'
            fill='#FFD23E'></path>
          <mask
            id='order-empty-state_svg__a'
            style={{ maskType: 'alpha' }}
            maskUnits='userSpaceOnUse'
            x='61'
            y='30'
            width='40'
            height='38'>
            <path
              d='M61.313 37.297c-.555-3.64 2.262-6.92 5.944-6.92h.619a3.826 3.826 0 013.638 2.644 3.826 3.826 0 003.639 2.643h11.625a4.183 4.183 0 003.89-2.643 4.183 4.183 0 013.889-2.643h.231c3.54 0 6.258 3.134 5.758 6.638l-2.376 16.63a16 16 0 01-15.84 13.738h-2.686a16 16 0 01-15.818-13.59l-2.513-16.497z'
              fill='#EE5351'></path>
          </mask>
          <g mask='url(#order-empty-state_svg__a)'>
            <path
              d='M61.313 37.297c-.555-3.64 2.262-6.92 5.944-6.92h.619a3.826 3.826 0 013.638 2.644 3.826 3.826 0 003.639 2.643h11.625a4.183 4.183 0 003.89-2.643 4.183 4.183 0 013.889-2.643h.231c3.54 0 6.258 3.134 5.758 6.638l-2.376 16.63a16 16 0 01-15.84 13.738h-2.686a16 16 0 01-15.818-13.59l-2.513-16.497z'
              fill='#EE5351'></path>
            <path d='M77.32 61.745a15 15 0 0014.83-12.75l2.824-18.617h6.167V68.44H64.84v-6.696h12.48z' fill='#DB4646'></path>
          </g>
          <path
            d='M69.885 49.508c-.916-2.634 1.04-5.385 3.828-5.385h14.679c2.788 0 4.744 2.75 3.828 5.385a4.053 4.053 0 01-3.828 2.721H73.713a4.053 4.053 0 01-3.828-2.721z'
            fill='#FEC110'></path>
          <mask
            id='order-empty-state_svg__b'
            style={{ maskType: 'alpha' }}
            maskUnits='userSpaceOnUse'
            x='98'
            y='46'
            width='26'
            height='23'>
            <rect
              x='118.847'
              y='43.77'
              width='15.673'
              height='27.363'
              rx='7.836'
              transform='rotate(60 118.847 43.77)'
              fill='#F2AEA0'></rect>
          </mask>
          <g mask='url(#order-empty-state_svg__b)'>
            <rect
              x='118.847'
              y='43.77'
              width='15.673'
              height='27.363'
              rx='7.836'
              transform='rotate(60 118.847 43.77)'
              fill='#F2AEA0'></rect>
            <path
              d='M117.883 40.923l6.815 11.803-12.492 7.212a8.178 8.178 0 01-11.171-2.993 5.452 5.452 0 011.996-7.447l14.852-8.575z'
              fill='#FFC5AB'></path>
          </g>
          <mask
            id='order-empty-state_svg__c'
            style={{ maskType: 'alpha' }}
            maskUnits='userSpaceOnUse'
            x='98'
            y='63'
            width='26'
            height='23'>
            <rect
              x='118.847'
              y='61.04'
              width='15.673'
              height='27.363'
              rx='7.836'
              transform='rotate(60 118.847 61.04)'
              fill='#F2AEA0'></rect>
          </mask>
          <g mask='url(#order-empty-state_svg__c)'>
            <rect
              x='118.847'
              y='61.04'
              width='15.673'
              height='27.363'
              rx='7.836'
              transform='rotate(60 118.847 61.04)'
              fill='#F2AEA0'></rect>
            <path
              d='M117.906 58.18l6.815 11.803-12.515 7.225a8.178 8.178 0 01-11.171-2.993 5.452 5.452 0 011.996-7.448l14.875-8.588z'
              fill='#FFC5AB'></path>
          </g>
          <rect
            x='135.073'
            y='10.171'
            width='19.287'
            height='46.071'
            rx='9.643'
            transform='rotate(60 135.073 10.171)'
            fill='#FFC5AB'></rect>
          <circle cx='109.769' cy='108.091' r='25.552' fill='#09CC66'></circle>
          <path
            fillRule='evenodd'
            clipRule='evenodd'
            d='M94.405 103.617a3.173 3.173 0 014.48.244l8.309 9.267 16.112-14.445a3.172 3.172 0 114.235 4.724l-18.474 16.562a3.172 3.172 0 01-4.479-.244l-10.427-11.628a3.173 3.173 0 01.244-4.48z'
            fill='#fff'></path>
        </g>
        <defs>
          <clipPath id='order-empty-state_svg__clip0_14_78'>
            <path fill='#fff' d='M0 0h142v142H0z'></path>
          </clipPath>
        </defs>
      </svg>

      <h4 className={styles.noActiveOrders__title}>У вас немає поточних замовлень</h4>
      <p className={styles.noActiveOrders__text}>Щоб побачити список поточних замовлень, потрібно оформити замовлення</p>
    </div>
  );
};

export default NoActiveOrders;
